tap "homebrew/bundle"		# homebrew core
tap "homebrew/services"		# homebrew core
tap "homebrew/cask-fonts"	# homebrew fonts

tap "teamookla/speedtest"	# speedtest
tap "candid82/brew" 		# karabiner-goku
tap "yqrashawn/goku"		# karabiner-goku
tap "qmk/qmk"			# QMK keyboard firmware

cask "karabiner-elements"
brew "yqrashawn/goku/goku"	# karabiner-elements JSON generator

brew "teamookla/speedtest/speedtest"	# speedtest CLI
brew "stow"			# .dotfiles/symlinks manager
brew "fzf"			# command-line fuzzy finder
brew "bat"			# cat(1) with syntax highlighting
brew "ffmpeg"			# convert and stream audio and video
brew "git-lfs"			# git extension for versioning large files
brew "dockutil"			# manage dock items
brew "htop"			# interactive process viewer
brew "imagemagick"		# manipulate images in many formats
brew "jq"			# command-line JSON processor
brew "mas"			# Mac App Store command-line interface
brew "neovim", args: ["HEAD"]	# text editor
brew "asdf"			# version manager for ruby, python and more
brew "tig"			# git text interface
brew "tree"			# display directories as trees
brew "qmk/qmk/qmk"		# QMK firmware for my Dactyl Manuform

cask "alfred"			# application launcher
cask "hammerspoon"		# desktop automation application
cask "iterm2"			# terminal emulator
cask "figma"			# UI design tool
cask "sublime-text"		# text editor
cask "transmission"		# open-source torrent client
cask "vlc"			# multimedia player
cask "drawio"			# diagram software
cask "font-hack-nerd-font"	# font with icons
cask "logi-options-plus"	# Logi Options+ for "MX Anywhere 2S"


# TODO: maybe
#
# brew "luarocks"		# Lua package manager
# brew "stylua"			# Lua code formatter
# brew "mackup"
# brew "ansible"		# automation
# brew "emacs"
# brew "pandoc"
# brew "tmux"
# brew "ripgrep"		# search tool like grep
# brew "vim"
# brew "wget"
# brew "swiftformat"
# brew "youtube-dl"
# cask "firefox"
# cask "jetbrains-toolbox"
# cask "shortcat"
# cask "visual-studio-code"
# cask "macdown"
#
# Quick Look
# cask "qlcolorcode"
# cask "qlimagesize"
# cask "qlmarkdown"
# cask "qlstephen"
# cask "qlvideo"
# cask "quicklook-json"
# cask "quicklookase"
# cask "webpquicklook"

# TODO: to review
#
# mas "Dark Reader for Safari", id: 1438243180
# mas "Developer", id: 640199958
# mas "GarageBand", id: 682658836
# mas "iMazing Converter", id: 1292198261
# mas "iMovie", id: 408981434
# mas "Keynote", id: 409183694
# mas "MeetingBar", id: 1532419400
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Skitch", id: 425955336
# mas "Vimari", id: 1480933944

# TODO: not sure
#
# brew "rbenv"
# brew "openssl@1.1"
# brew "pycparser"
# brew "cffi"
# brew "xz"
# brew "boost"
# brew "berkeley-db"
# brew "glib"
# brew "carthage"
# brew "libevent"
# brew "p11-kit"
# brew "unbound"
# brew "gnutls"
# brew "tree-sitter"
# brew "fasd"
# brew "fd"
# brew "harfbuzz"
# brew "openjpeg"
# brew "leptonica"
# brew "libass"
# brew "libbluray"
# brew "pango"
# brew "srt"
# brew "tesseract"
# brew "freetds"
# brew "gd"
# brew "ghostscript"
# brew "gobject-introspection"
# brew "helix"
# brew "ical-buddy"
# brew "libheif"
# brew "libraw"
# brew "lazygit"
# brew "libffi"
# brew "libiconv"
# brew "libpq"
# brew "libraqm"
# brew "perl"
# brew "php"
# brew "tcl-tk"
# brew "pillow"
# brew "python@3.10"
# brew "python@3.11"
# brew "python@3.9"
# brew "ranger"
# brew "ruby-build"
# brew "ruby@2.7"
# brew "sleepwatcher", restart_service: true
# brew "socat"
# brew "lynx"
# brew "thefuck"
# brew "xcodegen"
# brew "zlib"
# brew "libusbmuxd"
# brew "zsh-syntax-highlighting"
# cask "android-studio"
# cask "apparency"
# cask "background-music"
# cask "chromedriver"
# cask "neovide"
# cask "copilot-for-xcode"
# cask "suspicious-package"
# cask "swiftformat-for-xcode"
# cask "rubymine"
# cask "logitech-options"		# obsolete, use logi-options-plus instead
