# official taps
tap "homebrew/bundle"		# homebrew core
tap "homebrew/services"		# homebrew core
tap "homebrew/cask"		# homebrew fonts
# 3rd party taps
tap "teamookla/speedtest"	# speedtest
tap "candid82/brew" 		# karabiner-goku
tap "yqrashawn/goku"		# karabiner-goku

# dotfiles
brew "stow"	       		# .dotfiles/symlinks manager
brew "dockutil"		    	# manage dock items

# keyboard
cask "karabiner-elements"
brew "yqrashawn/goku/goku"	# karabiner-elements JSON generator

# Dactyl Manuform keyboard tools installed as part of the install script
tap "qmk/qmk"	    		# QMK firmware
brew "qmk/qmk/qmk"		# QMK firmware for my split keyboard

# essential brews
brew "teamookla/speedtest/speedtest"	# speedtest CLI
brew "fzf"		        # command-line fuzzy finder
brew "bat"		        # cat(1) with syntax highlighting
brew "ffmpeg"		    	# convert and stream audio and video
brew "git-lfs"		    	# git extension for versioning large files
brew "htop"	 	        # interactive process viewer
brew "imagemagick"		# manipulate images in many formats
brew "jq"		        # command-line JSON processor
brew "mas"			# Mac App Store command-line interface
brew "neovim", args: ["HEAD"]	# text editor
brew "asdf"		       	# version manager for ruby, python and more
brew "tig"		       	# git text interface
brew "tree"		       	# display directories as trees
# essential casks
cask "alfred"		    	# application launcher
cask "hammerspoon"	    	# desktop automation application
cask "iterm2"		    	# terminal emulator
cask "figma"		    	# UI design tool
cask "sublime-text"	    	# text editor
cask "transmission"	    	# open-source torrent client
cask "vlc"		        # multimedia player
cask "drawio"			# diagram software
cask "font-hack-nerd-font"	# font with icons
cask "logi-options-plus"	# Logi Options+ for "MX Anywhere 2S"


